###################################################################

# Created by write_sdc on Sun Jul 12 19:34:20 2026

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
set_load -pin_load 0.05 [get_ports {dout_low[7]}]
set_load -pin_load 0.05 [get_ports {dout_low[6]}]
set_load -pin_load 0.05 [get_ports {dout_low[5]}]
set_load -pin_load 0.05 [get_ports {dout_low[4]}]
set_load -pin_load 0.05 [get_ports {dout_low[3]}]
set_load -pin_load 0.05 [get_ports {dout_low[2]}]
set_load -pin_load 0.05 [get_ports {dout_low[1]}]
set_load -pin_load 0.05 [get_ports {dout_low[0]}]
set_load -pin_load 0.05 [get_ports {dout_high[7]}]
set_load -pin_load 0.05 [get_ports {dout_high[6]}]
set_load -pin_load 0.05 [get_ports {dout_high[5]}]
set_load -pin_load 0.05 [get_ports {dout_high[4]}]
set_load -pin_load 0.05 [get_ports {dout_high[3]}]
set_load -pin_load 0.05 [get_ports {dout_high[2]}]
set_load -pin_load 0.05 [get_ports {dout_high[1]}]
set_load -pin_load 0.05 [get_ports {dout_high[0]}]
set_load -pin_load 0.05 [get_ports zero]
set_load -pin_load 0.05 [get_ports error]
set_load -pin_load 0.05 [get_ports cpu_rdy]
set_load -pin_load 0.05 [get_ports test_so]
create_clock [get_ports clk]  -name MY_CLK  -period 10  -waveform {0 5}
set_clock_latency 1  [get_clocks MY_CLK]
set_clock_uncertainty -setup 1  [get_clocks MY_CLK]
set_clock_transition -min -fall 0.2 [get_clocks MY_CLK]
set_clock_transition -min -rise 0.2 [get_clocks MY_CLK]
set_clock_transition -max -fall 0.2 [get_clocks MY_CLK]
set_clock_transition -max -rise 0.2 [get_clocks MY_CLK]
set_input_delay -clock MY_CLK  0.1  [get_ports rst]
set_input_delay -clock MY_CLK  0.1  [get_ports {cmdin[6]}]
set_input_delay -clock MY_CLK  0.1  [get_ports {cmdin[5]}]
set_input_delay -clock MY_CLK  0.1  [get_ports {cmdin[4]}]
set_input_delay -clock MY_CLK  0.1  [get_ports {cmdin[3]}]
set_input_delay -clock MY_CLK  0.1  [get_ports {cmdin[2]}]
set_input_delay -clock MY_CLK  0.1  [get_ports {cmdin[1]}]
set_input_delay -clock MY_CLK  0.1  [get_ports {cmdin[0]}]
set_input_delay -clock MY_CLK  0.1  [get_ports {din_1[7]}]
set_input_delay -clock MY_CLK  0.1  [get_ports {din_1[6]}]
set_input_delay -clock MY_CLK  0.1  [get_ports {din_1[5]}]
set_input_delay -clock MY_CLK  0.1  [get_ports {din_1[4]}]
set_input_delay -clock MY_CLK  0.1  [get_ports {din_1[3]}]
set_input_delay -clock MY_CLK  0.1  [get_ports {din_1[2]}]
set_input_delay -clock MY_CLK  0.1  [get_ports {din_1[1]}]
set_input_delay -clock MY_CLK  0.1  [get_ports {din_1[0]}]
set_input_delay -clock MY_CLK  0.1  [get_ports {din_2[7]}]
set_input_delay -clock MY_CLK  0.1  [get_ports {din_2[6]}]
set_input_delay -clock MY_CLK  0.1  [get_ports {din_2[5]}]
set_input_delay -clock MY_CLK  0.1  [get_ports {din_2[4]}]
set_input_delay -clock MY_CLK  0.1  [get_ports {din_2[3]}]
set_input_delay -clock MY_CLK  0.1  [get_ports {din_2[2]}]
set_input_delay -clock MY_CLK  0.1  [get_ports {din_2[1]}]
set_input_delay -clock MY_CLK  0.1  [get_ports {din_2[0]}]
set_input_delay -clock MY_CLK  0.1  [get_ports {din_3[7]}]
set_input_delay -clock MY_CLK  0.1  [get_ports {din_3[6]}]
set_input_delay -clock MY_CLK  0.1  [get_ports {din_3[5]}]
set_input_delay -clock MY_CLK  0.1  [get_ports {din_3[4]}]
set_input_delay -clock MY_CLK  0.1  [get_ports {din_3[3]}]
set_input_delay -clock MY_CLK  0.1  [get_ports {din_3[2]}]
set_input_delay -clock MY_CLK  0.1  [get_ports {din_3[1]}]
set_input_delay -clock MY_CLK  0.1  [get_ports {din_3[0]}]
set_input_delay -clock MY_CLK  0.1  [get_ports test_si]
set_input_delay -clock MY_CLK  0.1  [get_ports test_se]
set_output_delay -clock MY_CLK  0.1  [get_ports {dout_low[7]}]
set_output_delay -clock MY_CLK  0.1  [get_ports {dout_low[6]}]
set_output_delay -clock MY_CLK  0.1  [get_ports {dout_low[5]}]
set_output_delay -clock MY_CLK  0.1  [get_ports {dout_low[4]}]
set_output_delay -clock MY_CLK  0.1  [get_ports {dout_low[3]}]
set_output_delay -clock MY_CLK  0.1  [get_ports {dout_low[2]}]
set_output_delay -clock MY_CLK  0.1  [get_ports {dout_low[1]}]
set_output_delay -clock MY_CLK  0.1  [get_ports {dout_low[0]}]
set_output_delay -clock MY_CLK  0.1  [get_ports {dout_high[7]}]
set_output_delay -clock MY_CLK  0.1  [get_ports {dout_high[6]}]
set_output_delay -clock MY_CLK  0.1  [get_ports {dout_high[5]}]
set_output_delay -clock MY_CLK  0.1  [get_ports {dout_high[4]}]
set_output_delay -clock MY_CLK  0.1  [get_ports {dout_high[3]}]
set_output_delay -clock MY_CLK  0.1  [get_ports {dout_high[2]}]
set_output_delay -clock MY_CLK  0.1  [get_ports {dout_high[1]}]
set_output_delay -clock MY_CLK  0.1  [get_ports {dout_high[0]}]
set_output_delay -clock MY_CLK  0.1  [get_ports zero]
set_output_delay -clock MY_CLK  0.1  [get_ports error]
set_output_delay -clock MY_CLK  0.1  [get_ports cpu_rdy]
set_output_delay -clock MY_CLK  0.1  [get_ports test_so]
set_input_transition -max 0.2  [get_ports rst]
set_input_transition -min 0.2  [get_ports rst]
set_input_transition -max 0.2  [get_ports {cmdin[6]}]
set_input_transition -min 0.2  [get_ports {cmdin[6]}]
set_input_transition -max 0.2  [get_ports {cmdin[5]}]
set_input_transition -min 0.2  [get_ports {cmdin[5]}]
set_input_transition -max 0.2  [get_ports {cmdin[4]}]
set_input_transition -min 0.2  [get_ports {cmdin[4]}]
set_input_transition -max 0.2  [get_ports {cmdin[3]}]
set_input_transition -min 0.2  [get_ports {cmdin[3]}]
set_input_transition -max 0.2  [get_ports {cmdin[2]}]
set_input_transition -min 0.2  [get_ports {cmdin[2]}]
set_input_transition -max 0.2  [get_ports {cmdin[1]}]
set_input_transition -min 0.2  [get_ports {cmdin[1]}]
set_input_transition -max 0.2  [get_ports {cmdin[0]}]
set_input_transition -min 0.2  [get_ports {cmdin[0]}]
set_input_transition -max 0.2  [get_ports {din_1[7]}]
set_input_transition -min 0.2  [get_ports {din_1[7]}]
set_input_transition -max 0.2  [get_ports {din_1[6]}]
set_input_transition -min 0.2  [get_ports {din_1[6]}]
set_input_transition -max 0.2  [get_ports {din_1[5]}]
set_input_transition -min 0.2  [get_ports {din_1[5]}]
set_input_transition -max 0.2  [get_ports {din_1[4]}]
set_input_transition -min 0.2  [get_ports {din_1[4]}]
set_input_transition -max 0.2  [get_ports {din_1[3]}]
set_input_transition -min 0.2  [get_ports {din_1[3]}]
set_input_transition -max 0.2  [get_ports {din_1[2]}]
set_input_transition -min 0.2  [get_ports {din_1[2]}]
set_input_transition -max 0.2  [get_ports {din_1[1]}]
set_input_transition -min 0.2  [get_ports {din_1[1]}]
set_input_transition -max 0.2  [get_ports {din_1[0]}]
set_input_transition -min 0.2  [get_ports {din_1[0]}]
set_input_transition -max 0.2  [get_ports {din_2[7]}]
set_input_transition -min 0.2  [get_ports {din_2[7]}]
set_input_transition -max 0.2  [get_ports {din_2[6]}]
set_input_transition -min 0.2  [get_ports {din_2[6]}]
set_input_transition -max 0.2  [get_ports {din_2[5]}]
set_input_transition -min 0.2  [get_ports {din_2[5]}]
set_input_transition -max 0.2  [get_ports {din_2[4]}]
set_input_transition -min 0.2  [get_ports {din_2[4]}]
set_input_transition -max 0.2  [get_ports {din_2[3]}]
set_input_transition -min 0.2  [get_ports {din_2[3]}]
set_input_transition -max 0.2  [get_ports {din_2[2]}]
set_input_transition -min 0.2  [get_ports {din_2[2]}]
set_input_transition -max 0.2  [get_ports {din_2[1]}]
set_input_transition -min 0.2  [get_ports {din_2[1]}]
set_input_transition -max 0.2  [get_ports {din_2[0]}]
set_input_transition -min 0.2  [get_ports {din_2[0]}]
set_input_transition -max 0.2  [get_ports {din_3[7]}]
set_input_transition -min 0.2  [get_ports {din_3[7]}]
set_input_transition -max 0.2  [get_ports {din_3[6]}]
set_input_transition -min 0.2  [get_ports {din_3[6]}]
set_input_transition -max 0.2  [get_ports {din_3[5]}]
set_input_transition -min 0.2  [get_ports {din_3[5]}]
set_input_transition -max 0.2  [get_ports {din_3[4]}]
set_input_transition -min 0.2  [get_ports {din_3[4]}]
set_input_transition -max 0.2  [get_ports {din_3[3]}]
set_input_transition -min 0.2  [get_ports {din_3[3]}]
set_input_transition -max 0.2  [get_ports {din_3[2]}]
set_input_transition -min 0.2  [get_ports {din_3[2]}]
set_input_transition -max 0.2  [get_ports {din_3[1]}]
set_input_transition -min 0.2  [get_ports {din_3[1]}]
set_input_transition -max 0.2  [get_ports {din_3[0]}]
set_input_transition -min 0.2  [get_ports {din_3[0]}]
set_input_transition -max 0.2  [get_ports test_si]
set_input_transition -min 0.2  [get_ports test_si]
set_input_transition -max 0.2  [get_ports test_se]
set_input_transition -min 0.2  [get_ports test_se]
set_false_path   -from [get_ports rst]
